---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyzesAs
source: html/1e18b801-c205-ba17-a693-82929ff9d6d3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyzesAs Property

"Analyze As"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAnalyzesAs { get; }
```